
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры


#КонецОбласти   //ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначениеСпискомПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

 

#КонецОбласти   //ОбработчикиСобытийЭлементовШапкиФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Элементы.Значение.Видимость = НЕ Объект.ЗначениеСписком;
	Элементы.Значения.Видимость = Объект.ЗначениеСписком;
		
КонецПроцедуры





#КонецОбласти  //СлужебныеПроцедурыИФункции
 