
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.грНастройки КАК грНастройки
	|ГДЕ
	|	грНастройки.Ссылка = &Ссылка
	|	И НЕ грНастройки.Код = &Код";
	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр( "Ссылка" , Ссылка );
	Запрос.УстановитьПараметр( "Код"	, Код );
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() ИЛИ НЕ ЗначениеЗаполнено( Ссылка ) Тогда
		
		ТекстОшибки = "Создавать новые элементы или изменять реквизит ""Идентификатор"" возможно в режиме конфигуратора!!!";
		Сообщить( ТекстОшибки, СтатусСообщения.ОченьВажное );
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры
