#Область ПрограммныйИнтерфейс

#Область МенеджерРегистрацииОшибок

// Возвращает имя события журнала регистрации по умлочанию..
//
//	Возвращаемое значение:
//		Строка
Функция ИмяСобытияЖурналаРегистрацийПоУмолчанию() Экспорт
	
	Возврат "Градум: ";
		
КонецФункции

#КонецОбласти //МенеджерРегистрацииОшибок

#КонецОбласти //ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти //СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти //СлужебныеПроцедурыИФункции 